Все действия:

1.Создаем файл .gitignore
в ней прописываем *.sass для добаления файлов
и bin/ admin/ config/ для добавления папок
прописываем команду (git add .)

2.Добавление всех файлов в локальное хранилище: 
(git add *)-подготовка к добавлению вообще всего
(git commit -m "Ferst v")- добавление в локальное хранилище

3.Создание ветки и переход на нее
(git branch forum) создание ветки
(git checkout forum) переход на нее.
создаем папку через значек"создание новой папки"
находясь в папке создаем два файла через значек "создать файл"
